seregonwar/Ghostpad/esp32-ghostpad/sdkconfig.defaults.esp32
CONFIG_IDF_TARGET="esp32"

CONFIG_HTTPD_WS_SUPPORT=y

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_esp32.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ---------------------------------------------------------------------------
# Built-in WiFi
# ---------------------------------------------------------------------------
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32

# ---------------------------------------------------------------------------
# Bluetooth Classic (BT) + HID Host — DualSense uses BT, not BLE
# ---------------------------------------------------------------------------
CONFIG_BT_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=y
CONFIG_BT_BLE_ENABLED=n
CONFIG_BT_HID_HOST_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=y
CONFIG_BTDM_CTRL_BR_EDR_MAX_ACL_CONN=2
CONFIG_BTDM_CTRL_BR_EDR_SCO_DATA_PATH_HCI=n

# ---------------------------------------------------------------------------
# Ghostpad Bridge Configuration
# ---------------------------------------------------------------------------
CONFIG_GHOSTPAD_WIFI_HOSTNAME="ghostpad"
CONFIG_GHOSTPAD_STA_SSID=""
CONFIG_GHOSTPAD_STA_PASSWORD=""
CONFIG_GHOSTPAD_STA_MAX_RETRY=5
CONFIG_GHOSTPAD_STA_CONNECT_TIMEOUT_SEC=15
CONFIG_GHOSTPAD_AP_SSID="Ghostpad-ESP32"
CONFIG_GHOSTPAD_AP_PASSWORD="ghostpad123"
CONFIG_GHOSTPAD_AP_MAX_CONN=4
CONFIG_GHOSTPAD_AP_CHANNEL=1
CONFIG_GHOSTPAD_ENABLE_MDNS=y
